Управление_пожарной_частью_/src/DataProcessors/ЗагрузкаИзExcelЛичныйСостав/ЗагрузкаИзExcelЛичныйСостав.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗагрузкаИзExcelЛичныйСостав</name>
</mdclass:DataProcessor>

Управление_пожарной_частью_/src/Enums/Пол/Пол.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Пол</name>
  <enumValues>
    <name>Муж</name>
  </enumValues>
  <enumValues>
    <name>Жен</name>
  </enumValues>
</mdclass:Enum>

Управление_пожарной_частью_/src/Enums/Должности/Должности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Должности</name>
  <enumValues>
    <name>Водитель</name>
  </enumValues>
  <enumValues>
    <name>Пожарный</name>
  </enumValues>
  <enumValues>
    <name>СтаршийПожарный</name>
  </enumValues>
  <enumValues>
    <name>Диспетчер</name>
  </enumValues>
  <enumValues>
    <name>НачальникКараула</name>
  </enumValues>
  <enumValues>
    <name>ПомощникНачальникаКараула</name>
  </enumValues>
  <enumValues>
    <name>КомандирОтделения</name>
  </enumValues>
  <enumValues>
    <name>Кладовщик</name>
  </enumValues>
  <enumValues>
    <name>Инструктор</name>
  </enumValues>
</mdclass:Enum>

Управление_пожарной_частью_/src/Catalogs/ФизическиеЛица/ФизическиеЛица.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ФизическиеЛица</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <type>
      <types>EnumRef.Пол</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>EnumRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеКартинки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Управление_пожарной_частью_/src/Catalogs/ГруппаСотрудников/ГруппаСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ГруппаСотрудников</name>
  <attributes>
    <name>НачальникКараула</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Сотрудники</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>EnumRef.Должности</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Управление_пожарной_частью_/src/DataProcessors/ЗагрузкаИзExcelЛичныйСостав/Forms/Форма/Module.bsl
&НаКлиенте
Процедура СсылкаНаФайлНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	Попытка
		Оповещение = Новый ОписаниеОповещения("ЗагрузкаДанных", ЭтотОбъект);
		НачатьПомещениеФайлаНаСервер(Оповещение,,,,,УникальныйИдентификатор);
		
	Исключение
		ПредупреждениеАсинх("Проверьте не открыт ли файл в другом приложении");
	КонецПопытки;
	
КонецПроцедуры 

&НаКлиенте
Процедура ЗагрузкаДанных(ОписаниеПомещенногоФайла, ДополнительныеПараметры) Экспорт
	Если  ОписаниеПомещенногоФайла = Неопределено Тогда
		
		Возврат;	
		
	КонецЕсли;
	СсылкаНаФайл = ОписаниеПомещенногоФайла.СсылкаНаФайл.Файл.ПолноеИмя;
	
КонецПроцедуры 

&НаКлиенте
Процедура ЗагрузитьФизическиеЛица(Команда)
	Если ПустаяСтрока(СсылкаНаФайл) Тогда
		
		Сообщить ("Укажите путь к файлу");
		Возврат;
		
	КонецЕсли;
	ИмпотрФизическихЛиц (СсылкаНаФайл);
	ОбновитьИнтерфейс();
КонецПроцедуры

&НаСервере
Процедура ИмпотрФизическихЛиц (ПутьКФайлу)
	ТабДок = Новый ТабличныйДокумент;
	Попытка
		
		ТабДок.Прочитать(ПутьКФайлу);
		
	Исключение
		Сообщить ("Не удалось прочитать файл" + ОписаниеОшибки());
		Возврат;
	КонецПопытки;
	КоличествоСтрок = ТабДок.ВысотаТаблицы;
	КоличествоСоздано = 0;  
	
	ГруппаГражданские = Справочники.ФизическиеЛица.НайтиПоНаименованию("Гражданские");
	ГруппаВоенные = Справочники.ФизическиеЛица.НайтиПоНаименованию("Военные");
	
	Для НомерСтроки = 2  По КоличествоСтрок Цикл
		
		
		Организация = СокрЛП(Строка(ТабДок.ПолучитьОбласть("R" + Формат(НомерСтроки, "ЧГ = 0") + "C1").ТекущаяОбласть.Текст));  
		ФИО = СокрЛП(Строка(ТабДок.ПолучитьОбласть("R" + Формат(НомерСтроки, "ЧГ = 0") + "C2").ТекущаяОбласть.Текст));
		Фамилия = СокрЛП(Строка(ТабДок.ПолучитьОбласть("R" + Формат(НомерСтроки, "ЧГ = 0") + "C3").ТекущаяОбласть.Текст)); 
		Имя = СокрЛП(Строка(ТабДок.ПолучитьОбласть("R" + Формат(НомерСтроки, "ЧГ = 0") + "C4").ТекущаяОбласть.Текст));
		Отчество = СокрЛП(Строка(ТабДок.ПолучитьОбласть("R" + Формат(НомерСтроки, "ЧГ = 0") + "C5").ТекущаяОбласть.Текст));
		Пол = СокрЛП(Строка(ТабДок.ПолучитьОбласть("R" + Формат(НомерСтроки, "ЧГ = 0") + "C6").ТекущаяОбласть.Текст));
		ДатаРождения = СокрЛП(Строка(ТабДок.ПолучитьОбласть("R" + Формат(НомерСтроки, "ЧГ = 0") + "C7").ТекущаяОбласть.Текст));  
		Должность = СокрЛП(Строка(ТабДок.ПолучитьОбласть("R" + Формат(НомерСтроки, "ЧГ = 0") + "C8").ТекущаяОбласть.Текст));
		Категория = СокрЛП(Строка(ТабДок.ПолучитьОбласть("R" + Формат(НомерСтроки, "ЧГ=0") + "C9").ТекущаяОбласть.Текст)); 
		
		
		Если Справочники.ФизическиеЛица.НайтиПоНаименованию(ФИО) = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
			НовыйСотрудник = Справочники.ФизическиеЛица.СоздатьЭлемент();
			НовыйСотрудник.Наименование = ФИО; 
			Организации = Справочники.Организации.НайтиПоНаименованию(Организации);
			НовыйСотрудник.Организация = Организации;
			НовыйСотрудник.Фамилия = Фамилия;
			НовыйСотрудник.Имя = Имя;
			НовыйСотрудник.Отчество = Отчество; 
			Если Пол = "Муж" Тогда
				НовыйСотрудник.Пол = Перечисления.Пол.Муж;
			ИначеЕсли Пол = "Жен" Тогда
				НовыйСотрудник.Пол = Перечисления.Пол.Жен;
			КонецЕсли;
			ДатаРожденияОбъект = '00010101';
			Если Не ПустаяСтрока(ДатаРождения) Тогда
				Попытка
					
					Если СтрДлина(ДатаРождения) = 10 И Найти(ДатаРождения, ".") > 0 Тогда
						День = Число(Сред(ДатаРождения, 1, 2));
						Месяц = Число(Сред(ДатаРождения, 4, 2));
						Год = Число(Сред(ДатаРождения, 7, 4));
						ДатаРождения = Дата(Год, Месяц, День);
					Иначе
						ДатаРождения = Дата(ДатаРождения);
					КонецЕсли;
				Исключение
					ДатаРождения = '00010101';
				КонецПопытки;
			КонецЕсли;
			НовыйСотрудник.ДатаРождения = ДатаРождения;
			Если Должность = "Водитель" Тогда
				НовыйСотрудник.Должность = Перечисления.Должности.Водитель;
			ИначеЕсли Должность = "Пожарный" Тогда
				НовыйСотрудник.Должность = Перечисления.Должности.Пожарный;
			ИначеЕсли Должность = "Старший пожарный" Тогда
				НовыйСотрудник.Должность = Перечисления.Должности.СтаршийПожарный;
			ИначеЕсли Должность = "Диспетчер" Тогда
				НовыйСотрудник.Должность = Перечисления.Должности.Диспетчер;
			ИначеЕсли Должность = "Начальник караула" Тогда
				НовыйСотрудник.Должность = Перечисления.Должности.НачальникКараула; 
			ИначеЕсли Должность = "Помощник начальника караула" Тогда
				НовыйСотрудник.Должность = Перечисления.Должности.ПомощникНачальникаКараула;
			ИначеЕсли Должность = "Комондир отделения" Тогда
				НовыйСотрудник.Должность = Перечисления.Должности.КомандирОтделения;
			ИначеЕсли Должность = "Кладовщик" Тогда
				НовыйСотрудник.Должность = Перечисления.Должности.Кладовщик; 
			ИначеЕсли Должность = "Инструктор" Тогда
				НовыйСотрудник.Должность = Перечисления.Должности.Инструктор;
			КонецЕсли; 
			Если Категория = "Гражданский" Тогда
				НовыйСотрудник.Родитель = ГруппаГражданские;
			ИначеЕсли Категория = "Военный" Тогда
				НовыйСотрудник.Родитель = ГруппаВоенные;
			КонецЕсли;
			
			Попытка
				
				НовыйСотрудник.Записать();
				КоличествоСоздано = КоличествоСоздано + 1;
				
			Исключение
				Сообщить ("Не удалось записать сотрудников" + ОписаниеОшибки());
				
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	Сообщить ("Создано сотрудников:  " + КоличествоСоздано);
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьГруппыСотрудников(Команда)
	Если ПустаяСтрока(СсылкаНаФайл) Тогда
		Сообщить("Укажите путь к файлу");
		Возврат;
	КонецЕсли;
	ИмпортКараулов(СсылкаНаФайл);
	ОбновитьИнтерфейс();
КонецПроцедуры 

&НаСервере
Процедура ИмпортКараулов(ПутьКФайлу)
	
	ТабДок = Новый ТабличныйДокумент;
	Попытка
		ТабДок.Прочитать(ПутьКФайлу);
	Исключение
		Сообщить("Не удалось прочитать файл: " + ОписаниеОшибки());
		Возврат;
	КонецПопытки;
	
	КоличествоСтрок = ТабДок.ВысотаТаблицы;
	
	ТекущийКараул = Неопределено;
	ТекущееНаименование = "";
	
	Для НомерСтроки = 2 По КоличествоСтрок Цикл
		
		Попытка
			
			Наименование = СокрЛП(Строка(ТабДок.ПолучитьОбласть("R" + Формат(НомерСтроки, "ЧГ=0") + "C1").ТекущаяОбласть.Текст));
			НачальникКараула = СокрЛП(Строка(ТабДок.ПолучитьОбласть("R" + Формат(НомерСтроки, "ЧГ=0") + "C2").ТекущаяОбласть.Текст));
			Организация = СокрЛП(Строка(ТабДок.ПолучитьОбласть("R" + Формат(НомерСтроки, "ЧГ=0") + "C3").ТекущаяОбласть.Текст));
			Сотрудник = СокрЛП(Строка(ТабДок.ПолучитьОбласть("R" + Формат(НомерСтроки, "ЧГ=0") + "C4").ТекущаяОбласть.Текст));
			Должность = СокрЛП(Строка(ТабДок.ПолучитьОбласть("R" + Формат(НомерСтроки, "ЧГ=0") + "C5").ТекущаяОбласть.Текст));
			
			Если Наименование <> ТекущееНаименование Тогда
				
				Если ТекущийКараул <> Неопределено Тогда
					ТекущийКараул.Записать();
					Сообщить("Сохранен караул: " + ТекущееНаименование);
				КонецЕсли;
				
				КараулСсылка = Справочники.ГруппаСотрудников.НайтиПоНаименованию(Наименование);
				Если КараулСсылка = Справочники.ГруппаСотрудников.ПустаяСсылка() Тогда
					ТекущийКараул = Справочники.ГруппаСотрудников.СоздатьЭлемент();
					ТекущийКараул.Наименование = Наименование;
				Иначе
					ТекущийКараул = КараулСсылка.ПолучитьОбъект();
				КонецЕсли;
				
				НачальникСсылка = Справочники.ФизическиеЛица.НайтиПоНаименованию(НачальникКараула);
				Если НачальникСсылка <> Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
					ТекущийКараул.НачальникКараула = НачальникСсылка;
				КонецЕсли;
				
				ОрганизацияСсылка = Справочники.Организации.НайтиПоНаименованию(Организация);
				Если ОрганизацияСсылка <> Справочники.Организации.ПустаяСсылка() Тогда
					ТекущийКараул.Организация = ОрганизацияСсылка;
				КонецЕсли;
				
				ТекущийКараул.Сотрудники.Очистить();
				
				ТекущееНаименование = Наименование;
			КонецЕсли;
			
			Если ТекущийКараул <> Неопределено Тогда
				
				НоваяСтрока = ТекущийКараул.Сотрудники.Добавить();
				
				СотрудникСсылка = Справочники.ФизическиеЛица.НайтиПоНаименованию(Сотрудник);
				Если СотрудникСсылка <> Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
					НоваяСтрока.Сотрудник = СотрудникСсылка;
				КонецЕсли;
				
				Если Должность = "Командир отделения" Тогда
					НоваяСтрока.Должность = Перечисления.Должности.КомандирОтделения;
				ИначеЕсли Должность = "Помощник начальника караула" Тогда
					НоваяСтрока.Должность = Перечисления.Должности.ПомощникНачальникаКараула;
				ИначеЕсли Должность = "Диспетчер" Тогда
					НоваяСтрока.Должность = Перечисления.Должности.Диспетчер;
				ИначеЕсли Должность = "Старший пожарный" Тогда
					НоваяСтрока.Должность = Перечисления.Должности.СтаршийПожарный;
				ИначеЕсли Должность = "Пожарный" Тогда
					НоваяСтрока.Должность = Перечисления.Должности.Пожарный;
				ИначеЕсли Должность = "Водитель" Тогда
					НоваяСтрока.Должность = Перечисления.Должности.Водитель; 
				ИначеЕсли Должность = "Начальник караула" Тогда
					НоваяСтрока.Должность = Перечисления.Должности.НачальникКараула;
				ИначеЕсли Должность = "Кладовщик" Тогда
					НоваяСтрока.Должность = Перечисления.Должности.Кладовщик;
				ИначеЕсли Должность = "Инструктор" Тогда
					НоваяСтрока.Должность = Перечисления.Должности.Инструктор;
				КонецЕсли;
				
			КонецЕсли;
			
		Исключение
			Сообщить("Ошибка в строке " + НомерСтроки + ": " + ОписаниеОшибки());
		КонецПопытки;
		
	КонецЦикла;
	
	Если ТекущийКараул <> Неопределено Тогда
		ТекущийКараул.Записать();
		Сообщить("Успешно загружен караул: " + ТекущееНаименование);
	КонецЕсли;
	
КонецПроцедуры
